## Pandas SQL

In [1]:
import pandas as pd

In [2]:
import sqlite3

In [3]:
create_table = """
CREATE TABLE student_score
(Id INTEGER, Name VARCHAR(20), Math REAL,
Science Real
);"""

In [4]:
executeSQL = sqlite3.connect(':memory:')
executeSQL.execute(create_table)
executeSQL.commit()

In [5]:
# View table
#prepare a SQL query
SQL_query = executeSQL.execute('select * from student_score') 
#fetch result from the SQLlite database
resulset = SQL_query.fetchall()
resulset

[]

## Pandas SQL Operation

In [6]:
#prepare the data
insertSQL = [(10,'Jack',82,92),
             (29,'Tome',73,89),
             (65,'Ram',65.6,77),
             (5,'Steve',32,54)]

In [7]:
insert_statement = "INSERT INTO student_score VALUES(?,?,?,?)"
executeSQL.executemany(insert_statement,insertSQL)
executeSQL.commit()

In [19]:
#prepare a SQL query
SQL_query = executeSQL.execute('select * from student_score limit 2') 
#fetch result from the SQLlite database
resulset = SQL_query.fetchall()
resulset

[(10, 'Jack', 82.0, 92.0), (29, 'Tome', 73.0, 89.0)]

In [10]:
df = pd.DataFrame(resulset, 
                  columns=['ID', 'Name', 'Math', 'Science'])
df

   ID   Name  Math  Science
0  10   Jack  82.0     92.0
1  29   Tome  73.0     89.0
2  65    Ram  65.6     77.0
3   5  Steve  32.0     54.0

In [24]:
list=SQL_query.description
columns=[]
for i in list:
    columns.append(i[0])
    print(i)

print(columns)

('Id', None, None, None, None, None, None)
('Name', None, None, None, None, None, None)
('Math', None, None, None, None, None, None)
('Science', None, None, None, None, None, None)
['Id', 'Name', 'Math', 'Science']

In [26]:
df_column_sql=pd.DataFrame(resulset, columns=columns)
df_column_sql

   Id  Name  Math  Science
0  10  Jack  82.0     92.0
1  29  Tome  73.0     89.0

## Numpy

In [29]:
import numpy as np

In [41]:
distance=[12,15,20,10]
speed=[.30,0.3,0.85,0.15]
Dim2 = [[12,15,20,10],[.30,0.3,0.85,0.15]]

In [43]:
np_distance = np.array(distance)
np_speed=np.array(speed)
np_Dim2=np.array(Dim2)
speed = np_distance/np_speed

In [44]:
print(np_Dim2.ndim) # No. of row
print(np_Dim2.shape) # (row,column)
print(np_Dim2.size) # row x column
print(np_Dim2.dtype) # element type

2
(2, 4)
8
float64